[
  {
    "id": 10,
    "title": "SQL Injection Agent",
    "description": "CyberSecurity tool that uses OpenAPI spec and Docker to identify and exploit SQL injection vulnerabilities in web applications. It automates the process of finding and exploiting SQL injection flaws, making it easier for security professionals to assess the security of their applications.",
    "image": "/project-images/sqlmap.png",
    "link": "https://github.com/ronxldwilson/sql-injection-agent",
    "tags": [
      "Cyber Security",
      "Python",
      "Docker",
      "Pentesting"
    ]
  },
  {
    "id": 11,
    "title": "Dead Simple Form",
    "description": "A simple and easy-to-use form backend that allows users to create and customize forms without any coding knowledge. It offers various customization options to create professional-looking forms quickly. Handling backend form submissions and data storage, making it a complete solution for form creation and management.",
    "image": "/project-images/deadsimpleform.png",
    "link": "https://deadsimpleform.com/",
    "tags": [
      "Next.js",
      "React",
      "Tailwind CSS",
      "Supabase"
    ]
  },
  {
    "id": 20,
    "title": "3D Sudoku",
    "description": "A 3 dimensional version of the classic Sudoku puzzle game, where players fill a 9 x 9 grid with numbers while adhering to traditional Sudoku rules. The game offers an immersive experience with interactive 3D graphics, allowing players to rotate and view the puzzle from different angles.",
    "image": "/project-images/3dsudoku.png",
    "link": "https://3-d-sudoku.vercel.app/",
    "tags": [
      "Three.js",
      "Next.js",
      "Game Development",
      "Javascript"
    ]
  },
  {
    "id": 30,
    "title": "AI in the Shell",
    "description": "AI in the shell is a command-line tool that integrates with Ollama's local LLMs to bring AI capabilities directly to your terminal. It allows users to interact with AI models, generate text, and perform various tasks using simple shell commands. The ultimate of the project is to build an AI agent that act as system administrator to help with various tasks and be autonomously deployed on a server to manage it.",
    "image": "/project-images/ai-in-the-shell.png",
    "link": "https://github.com/ronxldwilson/AI-in-the-Shell",
    "tags": [
      "Python",
      "AI",
      "Ollama",
      "Shell",
      "CLI",
      "Terminal Tools"
    ]
  },
  {
    "id": 31,
    "title": "Tiny Notepad",
    "description": "Tiny Notepad is a lightweight, distraction-free interface to chat with locally running Ollama models. Designed for speed and simplicity, it lets you generate text, save timestamped notes, and tweak generation settings all in a sleek, minimal GUI.",
    "image": "/project-images/tiny-notepad.jpg",
    "link": "https://github.com/ronxldwilson/tiny-notepad",
    "tags": [
      "Python",
      "PyPi",
      "AI",
      "Ollama",
      "CLI"
    ]
  },
  
  {
    "id": 40,
    "title": "DashAway",
    "description": "Chrome extension to remove all em dashes and other annoying formattings in the output of popular AI tools. It cleans up the text generated by AI models, making it more readable and user-friendly.",
    "image": "/project-images/dashaway.png",
    "link": "https://github.com/ronxldwilson/dashaway",
    "tags": [
      "Chrome Extension",
      "Javascript"
    ]
  },
  {
    "id": 50,
    "title": "Whatsapp Encrypter",
    "description": "Chrome extension that encrypts your WhatsApp Messages using custom encryption algorithms. It ensures that your messages are secure and private, protecting them from unauthorized access post leak",
    "image": "/project-images/whatsapp.png",
    "link": "https://github.com/ronxldwilson/WhatsApp-Encrypter",
    "tags": [
      "Chrome Extension",
      "Javascript",
      "Encryption",
      "Cyber Security"
    ]
  }
]