[
  {
    "id": 1,
    "title": "SQL Injection Agent",
    "description": "CyberSecurity tool that uses OpenAPI spec and Docker to identify and exploit SQL injection vulnerabilities in web applications. It automates the process of finding and exploiting SQL injection flaws, making it easier for security professionals to assess the security of their applications.",
    "image": "/project-images/sqlmap.png",
    "link": "https://github.com/ronxldwilson/sql-injection-agent",
    "tags": [
      "Cyber Security",
      "Python",
      "Docker",
      "Pentesting"
    ]
  },
  {
    "id": 4,
    "title": "3D Sudoku",
    "description": "A 3 dimensional version of the classic Sudoku puzzle game, where players fill a 9 x 9 grid with numbers while adhering to traditional Sudoku rules. The game offers an immersive experience with interactive 3D graphics, allowing players to rotate and view the puzzle from different angles.",
    "image": "/project-images/3dsudoku.png",
    "link": "https://3-d-sudoku.vercel.app/",
    "tags": [
      "Three.js",
      "Next.js",
      "Game Development",
      "Javascript"
    ]
  },
  {
    "id": 2,
    "title": "Tiny Notepad",
    "description": "Tiny Notepad is a lightweight, distraction-free interface to chat with locally running Ollama models. Designed for speed and simplicity, it lets you generate text, save timestamped notes, and tweak generation settings all in a sleek, minimal GUI.",
    "image": "/project-images/tiny-notepad.jpg",
    "link": "https://github.com/ronxldwilson/tiny-notepad",
    "tags": [
      "Python",
      "PyPi",
      "AI",
      "Ollama"
    ]
  },
  {
    "id": 3,
    "title": "DashAway",
    "description": "Chrome extension to remove all em dashes and other annoying formattings in the output of popular AI tools. It cleans up the text generated by AI models, making it more readable and user-friendly.",
    "image": "/project-images/dashaway.png",
    "link": "https://github.com/ronxldwilson/dashaway",
    "tags": [
      "Chrome Extension",
      "Javascript"
    ]
  }
]