{
    "name": "Ronald Wilson",
    "email": "ronxldwilson@gmail.com",
    "links": {
        "linkedin": "https://linkedin.com/in/ronxldwilson",
        "github": "https://github.com/ronxldwilson",
        "twitter": "https://x.com/ronxldwilson"
    },
    "executive_summary": "Web developer skilled in building scalable, secure, and high-performance applications. Specialized in full-stack development with expertise in Cloud, DevSecOps, and modern frameworks. Specialize in building AI-powered, user-centric interfaces that enhance application intelligence and usability. Active open source contributor, improving tools for developer community.",
    "experience": [
        {
            "company": "Better Together Wellness",
            "role": "Co-Founder & CTO",
            "duration": "Sept 2024 - June 2025",
            "achievements": [
                "Led the end-to-end development of a holistic mental wellness platform from concept to launch.",
                "Engineered responsive, scalable web applications using modern frameworks and cloud technologies.",
                "Designed robust authentication, data management, and real-time communication systems.",
                "Built AI-driven tools to enhance therapist training and improve treatment insights.",
                "Drove continuous improvement through user research and iterative product design."
            ]
        },
        {
            "company": "Deloitte Consulting USI",
            "role": "SAP BASIS Consultant",
            "duration": "Jun 2023 - Sept 2024",
            "achievements": [
                "Supported large-scale IT operations for enterprise clients, ensuring high system reliability.",
                "Strengthened infrastructure security through proactive vulnerability analysis and patch management.",
                "Delivered critical incident resolutions that minimized downtime and operational risk.",
                "Conducted performance assessments and implemented optimizations to improve system stability.",
                "Deployed scalable monitoring systems to achieve near-perfect service availability."
            ]
        },
        {
            "company": "Deloitte Consulting USI",
            "role": "ServiceNow Developer",
            "duration": "Aug 2022 - Jun 2023",
            "achievements": [
                "Developed and maintained enterprise-grade automation workflows within the ServiceNow ecosystem.",
                "Enhanced change and release management processes through data-driven DevSecOps solutions.",
                "Created reusable testing and risk evaluation frameworks that improved delivery efficiency.",
                "Streamlined IT operations by implementing process improvements with measurable impact."
            ]
        }
    ],
    "projects": [
        "BashOllama: CLI assistant generating bash commands using LLaMA-based model with LoRA.",
        "Deddit: Full-stack Reddit clone with Next.js and FastAPI, logging interactions for LLM training.",
        "Tiny-Notepad: Python notepad, published on PyPI, integrated with Ollama.",
        "WhatsApp Web Encrypter: Chrome extension for text encryption across messaging platforms.",
        "TechnoBoard: Chrome Extension for monitoring attention during online meetings.",
        "Writing Machine: Built a 2-axis writing machine using Arduino Uno."
    ],
    "positions_of_responsibility": [
        {
            "organization": "Youth4Seva",
            "role": "Thread Lead",
            "duration": "Sept 2022 - Nov 2023",
            "details": "Directed Impact Day activities, guided 200+ volunteers across 4 locations."
        }
    ],
    "internships": [
        {
            "organization": "WeJump",
            "role": "Digital Art Intern",
            "duration": "Apr 2022 - May 2022",
            "details": "Created eBooks of stories by underprivileged children, led volunteers, designed digital assets."
        },
        {
            "organization": "Inception Wave",
            "role": "Market Research Intern",
            "duration": "Sep 2020 - Oct 2020",
            "details": "Conducted market research and competitor analysis, created reports and presentations."
        }
    ],
    "education": [
        {
            "institution": "CHRIST (Deemed to be University)",
            "degree": "B.Sc in Computer Science, Mathematics and Statistics",
            "duration": "June 2019 - May 2022",
            "details": "CGPA: 8.81/10. Organized Web3 conference, well-versed in data analytics, ML, statistical modeling."
        }
    ],
    "certifications": [
        "ServiceNow Certified Application Developer",
        "ServiceNow Certified System Administrator",
        "SAP BASIS Administrator",
        "AI For Everyone"
    ],
    "skills": [
        "Next.js",
        "React",
        "FastAPI",
        "NextAuth",
        "Supabase",
        "Figma",
        "UI/UX Design",
        "Kafka",
        "Linux Administration",
        "AI/ML",
        "Node.js",
        "Express",
        "Zod",
        "OpenAPI",
        "Redis",
        "PostgreSQL",
        "Prisma",
        "MongoDB",
        "WebRTC",
        "Websockets",
        "Docker",
        "Kubernetes",
        "AWS",
        "Ollama",
        "Grafana",
        "SAP BASIS",
        "ServiceNow",
        "React Native",
        "SAP HANA",
        "SAP BTP"
    ],
    "languages": [
        "English (Fluent)",
        "Hindi (Fluent)",
        "German (Beginner A2)"
    ],
    "interests": [
        "Chess",
        "History",
        "Philosophy",
        "Psychology"
    ]
}